/* 
 * REESTR.NADLOC.KZ - тендерлеріне қатысуға арналған шаблондар
 */
 
var $supplier_kz = 'БатысГеоЗерттеу';
var $supplier_ru = 'БатысГеоЗерттеу';

var $supplier_boss_ru = 'директор - Нурмуханов Кайрат Умирович';
var $supplier_boss_kz = 'директор - Нұрмұқанов Қайрат Өмірұлы';

var $title_doc_kz = '«Алтиес Петролеум Интернэшнл Б.В.» компаниясының Ақтөбе филиалының конкурстық комиссиясының төрағасына';
var $title_doc_ru =  'Председателю конкурсной комиссии Актюбинского филиала компании «Алтиес Петролеум Интернэшнл Б.В.»';

var $tender_name_ru = 'Производство геофизических исследований в открытом стволу с последующей интерпретацией данных в скважинах месторождения «Акжар';
var $tender_name_kz = 'Ақжар» кен орнындағы ұңғымалардың деректеріне түсінік беріп, ашық оқпандағы ұңғымаларға геофизикалық зерттеу жүргізу';

var head = {
  supplier_kz:  $supplier_kz,
  supplier_ru:  $supplier_ru,

  title_doc_kz:  $title_doc_kz,
  title_doc_ru:  $title_doc_ru
  
};

module.exports = [
	// Письмо о составе учредителей
	{
		template: '1',
		filename: 'Письмо учредители',
		content_doc_ru: 'Настоящим сообщаем, что Устав ТОО «' + $supplier_ru + '» содержит сведения об учредителе и составе учредителей.',
		content_doc_kz: '«' + $supplier_kz + '» ЖШС-нің құрылтайшылары немесе құрылтайшылардың құрамы жайлы мәліметтер Жарғыда көрсетілген.',
    __proto__: head
	},
  // Письмо о доверенности
	{
		template: '1',
		filename: 'Письмо о доверенности',
		content_doc_ru: 'Настоящим сообщаем, что интересы ТОО «' + $supplier_ru + '» на право подписания заявки и документов, содержащихся в заявке на участие в проводимом открытом конкурсе по закупу работ «'+ $tender_name_ru + '» будет представлять первый руководитель, ' + $supplier_boss_ru + '.',
		content_doc_kz: '«' + $supplier_kz + '» ЖШС-гі өткізіліп отырған «'+ $tender_name_kz + '» ашық конкурстың құжаттарына және конкурсқа қатысуға арналған өтінішке ' + $supplier_boss_kz + ' мырзаның қолы қойылғанын хабардар етеді.',
    __proto__: head
	},
	// Письмо о ликвидации или банкротства
	{
		template: '1',
		filename: 'ПисьмоЛиквидБанкрот',
		content_doc_ru: 'Настоящим гарантируем, что ТОО «' + $supplier_ru + '» не находится в процессе ликвидации или банкротства.',
		content_doc_kz: 'Осымен «' + $supplier_kz + '» ЖШС қазіргі уақытта тарату немесе банкрот болу рәсімінде жоқ екеніне кепіл боламыз. ',
    __proto__: head
	},
	// Гарантийное письмо об отсутствии оснований 811
	{
		template: '2',
		filename: 'Гар.Письмо 811',
		content_title_ru: 'Гарантийное письмо',
		content_title_kz: 'Кепіл хат',
		content_doc_ru: 'Настоящим ТОО «' + $supplier_ru + '», ГАРАНТИРУЕТ, что не имеет оснований, запрещающих нам участвовать в проводимом открытом конкурсе по закупу работ «' + $tender_name_ru + '», предусмотренных 	подпунктом 3) пункта 8, подпунктах 1), 2) и 4) пункта 11 Правил приобретения товаров, работ и услуг при проведении операций по недропользованию, утвержденных постановлением Правительства Республики Казахстан №602 от 31.05.2014 года. ------>\
		В случае возникновения таких обстоятельств, мы понесем полную ответственность за предоставление недостоверной информации в том числе, материальные и денежные расходы заказчика, понесенные Заказчиком в связи с предоставлением нами недостоверной информации, в соответствии с действующим на дату представления информации законодательством Республики Казахстан. ',
		content_doc_kz: 'Осымен  «' + $supplier_kz + '» ЖШС-гі «' + $tender_name_kz + '» қызметтерін сатып алу ашық конкурсына қатысуға тыйым салатын, Қазақстан Республикасы Үкіметінің 2014 жылы 31 мамыр №602 Қаулысымен бекітілген Жер қойнауын пайдалану операцияларын жүргізу барысында тауарларды, жұмыстарды және қызметтерді сатып алу Қағидаларының 3 тармақшаның 8 тармағында және 1, 2, 4 тармақшалардың 11 тармағында көзделген негіздемелердің жоқтығы туралы КЕПІЛДІК БЕРЕДІ. ------->\
		Мұндай жағдайлар орын алса, біз шүбәлі ақпаратты ұсынғанымыз үшін, бұған шүбәлі ақпараттың ұсынылуына байланысты Тапсырыс берушінің материалдық және ақшалай шығыстары да кіреді, Қазақстан Республикасының ақпарат ұсынған күнге қолданыстағы заңнамасына сәйкес өзімізге толық жауапкершілікті аламыз. ',
    __proto__: head
	},
	// Гарантийное письмо о соблюдении требования о сдаче отчетности по местному содержанию
	{
		template: '2',
		filename: 'ОсдачеОтчетностиПоКазСод',
		content_title_ru: 'Гарантийное письмо',
		content_title_kz: 'Кепіл хат',
		content_doc_ru: 'Настоящим ТОО «' + $supplier_ru + '» гарантирует соблюдение требований о сдаче отчетности по местному содержанию по формам в соответствии с законодательством Республики Казахстан (Постановление Республики Казахстан от 20 сентября 2010 года №965 «Об утверждении форм и Правил составления и предоставления годовой, среднесрочной, долгосрочной программ закупа товаров, работ и услуг, отчетов недропользователей о приобретенных товарах, работах и услугах и об исполнении обязательств по местному содержанию) и ответственности за содержание информации отраженной в отчетах, нарушение сроков предоставления отчетности и несоблюдение потенциальными поставщиками обязательств по местному содержанию.',
		content_doc_kz: '«' + $supplier_kz + '» ЖШС-і осы хат арқылы Қазақстан Республикасының заңнамасына сәйкес үлгі бойынша жергілікті мазмұнға қатысты есептілікті тапсыру жайындағы талаптарды сақтау туралы кепілдік хаты (2010 жылдың 20 қыркүйегіндегі №965 Қазақстан Республикасының Қаулысы «Жер қойнауын пайдаланушылардың сатып алынған тауарлар, жұмыстар мен қызметтер және жергілікті мазмұн бойынша тауар, жұмыс және қызметті сатып алудығы жылдық, орта мерзімді, ұзақ мерзімді есептеме жасау мен ұсыну үлгілері мен Ережелерін бекіту туралы») мен есептемелерде бейнеленген ақпараттардың мазмұнының, есептілікті беру мерзімінің бұзылуы және әлеуетті жеткізушімен жергілікті мазмұн бойынша міндеттемелердің сақталуына кепілдік береді.',
    __proto__: head
	},
	// Письмо о сертификации на каждый ЛОТ отдельно
	{
		template: '1',
		filename: 'Письмо Сертификат',
		content_doc_ru: 'В связи с тем, что вид деятельности закупаемых услуг «' + $tender_name_ru +'» не подлежит обязательной сертификации, ТОО «' + $supplier_ru + '» вправе не предоставлять соответствующие документы.',
		content_doc_kz: 'Осы хат арқылы, «' + $tender_name_kz +'» бойынша сатып алу ҚР сертификаттау заңнамасына сәйкес, стандарт талаптарына сәйкестік сертификатына немесе өмірге, адам денсаулығына, азаматтардың мүлкі және қоршаған ортаға қауіпсіздік беретін басқа да нормативтік құжаттар сертификациялауға жатпайтынын хабарлаймыз.',
    __proto__: head
	},
	// Обязательства по местному содержанию на каждый ЛОТ отдельно
	{
		template: '3',
		filename: 'ОбязатПоМестнСодерж',
		percentage_kz: '100',
		percentage_ru: '100',
		content_title_ru: 'Обязательства по местному содержанию в предлагаемых работах, выраженные в процентах по каждому лоту (0-100)',
		content_title_kz: 'Жергілікті ұстау бойынша ұсынылатын жұмыстар əр бір лот бойынша пайызбен көрсетілген (0-100)',
		content_doc_ru: 'Настоящим  подтверждаем,  представленное  обязательство  по  казахстанскому  содержанию  в предлагаемых работах по открытому конкурсу «' + $tender_name_ru +'»',
		content_doc_kz: 'Осы арқылы, ұсынылған жұмыстардың жергілікті мазмұнында берілгендігін «' + $tender_name_kz +'» ашық конкурсы бойынша растаймыз.',
    __proto__: head
	},
	// Обязательства подрядчика о соблюдении настоящих Правил на каждый ЛОТ отдельно
	{
		template: '2',
		filename: 'ОбязатОСоблюденииПравил',
		content_title_ru: 'Обязательства Потенциального поставщика (подрядчика) о соблюдении настоящих Правил при исполнении договора на выполнение отдельных видов работ, связанных с проведением операций по недропользованию ',
		content_title_kz: 'Жер қойнауын пайдалану жөніндегі операцияларды жүргізу кезінде тауарларды, жұмыстар мен көрсетілетін қызметтерді сатып алу қағидаларын бекіту туралы мердігердің міндеттері',
		content_doc_ru: 'Настоящим обязуемся о соблюдении настоящих Правил приобретения товаров, работ и услуг при проведении операций по недропользованию посредством государственной информационной системы «Реестр товаров, работ и услуг, используемых при проведении операций по недропользованию, и их производителей» от 14 февраля 2013 года № 133, при исполнении договора на выполнение работ проведении операций по недропользованию», далее «Правила», при исполнении договора на выполнение отдельных видов работ, связанных с проведением операций по недропользованию.',
		content_doc_kz: 'Келісімшартты орындау кезінде Жер қойнауын қолдануға байланысты операцияларды жүргізу кезінде жұмыстардың жеке түрін орындауда «Жер қойнауын пайдалану жөніндегі операцияларды жүргізу кезінде тауарларды, жұмыстар мен көрсетілетін қызметтерді сатып алу қағидаларын бекіту туралы» Қазақстан Республикасы Үкіметінің 2013 жылғы 14 ақпандағы № 133 қаулысын, бұдан əрі «Қағида», сақтай отырып, мердігердің міндеттерін орындауға кепілдік береміз.',
    __proto__: head
	},
	// Гарантийное письмо об отсутствии оснований 1112 на каждый ЛОТ отдельно
	{
		template: '2',
		filename: 'Гар.Письмо 1112',
		content_title_ru: 'Гарантийное письмо',
		content_title_kz: 'Кепіл хат',
		content_doc_ru: 'Настоящим ТОО «' + $supplier_ru + '», ГАРАНТИРУЕТ, что не имеет оснований, запрещающих нам участвовать в проводимом открытом конкурсе по закупу работ «' + $tender_name_ru + '», предусмотренных 	подпунктах 3) и 5) пункта 11 и пункте 12 Правил приобретения товаров, работ и услуг при проведении операций по недропользованию, утвержденных постановлением Правительства Республики Казахстан №602 от 31.05.2014 года. ------>\
		В случае возникновения таких обстоятельств, мы понесем полную ответственность за предоставление недостоверной информации в том числе, материальные и денежные расходы заказчика, понесенные Заказчиком в связи с предоставлением нами недостоверной информации, в соответствии с действующим на дату представления информации законодательством Республики Казахстан. ',
		content_doc_kz: 'Осымен  «' + $supplier_kz + '» ЖШС-гі «' + $tender_name_kz + '» қызметтерін сатып алу ашық конкурсына қатысуға тыйым салатын, Қазақстан Республикасы Үкіметінің 2014 жылы 31 мамыр №602 Қаулысымен бекітілген Жер қойнауын пайдалану операцияларын жүргізу барысында тауарларды, жұмыстарды және қызметтерді сатып алу Қағидаларының 3, 5 тармақшалардың 11 тармағында және 12 тармағында көзделген негіздемелердің жоқтығы туралы КЕПІЛДІК БЕРЕДІ. ----->\
		Мұндай жағдайлар орын алса, біз шүбәлі ақпаратты ұсынғанымыз үшін, бұған шүбәлі ақпараттың ұсынылуына байланысты Тапсырыс берушінің материалдық және ақшалай шығыстары да кіреді, Қазақстан Республикасының ақпарат ұсынған күнге қолданыстағы заңнамасына сәйкес өзімізге толық жауапкершілікті аламыз. ',
    __proto__: head
	},
	// Письмо субподряд на каждый ЛОТ отдельно
	{
		template: '2',
		filename: 'Письмо субподряд',
		content_title_ru: 'Гарантийное письмо',
		content_title_kz: 'Кепіл хат',
		content_doc_ru: 'Настоящим ТОО «' + $supplier_ru + '» подтверждает, что при  выполнении работ закупаемых в данном конкурсе субподрядчики (соисполнители) не привлекутся.',
		content_doc_kz: 'Осымен  «' + $supplier_kz + '» ЖШС-гі осы конкурста сатып алынатын  жұмыстардың өз күшімізбен, яғни мердігерлерсіз атқарылатынын растайды. ',
    __proto__: head
	},
	// Гарантийное письмо, подтверждающее согласие потенциального поставщика с существенными условиями проекта договора на каждый ЛОТ отдельно
	{
		template: '2',
		filename: 'СоглУсловиямиДоговора',
		content_title_ru: 'Гарантийное письмо, подтверждающее согласие Потенциального поставщика с существенными условиями проекта договора о закупках',
		content_title_kz: 'Əлеуетті жеткізушінің шарт жобасының елеулі талаптарымен келіскендігін растайтын кепілхаты',
		content_doc_ru: 'Настоящим гарантируем согласие с существенными условиями проекта договора о закупках в проводимом открытом конкурсе «' + $tender_name_ru + '». ',
		content_doc_kz: 'Осы арқылы «' + $tender_name_kz + '» ашық конкурсына қатысуға шарт жобасының елеулі талаптарымен келіскендігіне кепілдік береміз.',
    __proto__: head
	}
];